{
  "monolith": {
    "name": "Monolith Productions (WB Games)",
    "date": "Jan 2023 - Apr 2025",
    "positions": {
      "gameplay_engineer": {
        "role": "Gameplay Engineer",
        "games": ["Wonder Woman (Cancelled)"],
        "date": "Sept 2023 - Apr 2025",
        "description": [
          "Created and expanded debugging tools to streamline the development process, enabling designers to more efficiently build core gameplay systems.",
          "Designed, developed and expanded versatile game objects, enabling designers to build core gameplay systems.",
          "Engineered new content streaming systems and a memory budgeting system to optimize dynamic content loading and resource usage.",
          "Improved existing streaming and mission and audio systems to support scalability.",
          "Optimized system performance, resulting in reduction in resource usage.",
          "Stepped up and authored documentation for the publishers."
        ]
      },
      "ui_engineer": {
        "role": "UI Engineer",
        "games": ["Wonder Woman (Cancelled)"],
        "date": "Jan 2022 - Sept 2023",
        "description": [
          "Collaborated with cross-disciplinary teams, including designers, artists, and QA, to develop core gameplay systems for an AAA title.",
          "Dived into diverse systems outside of core gameplay expertise, broadening technical knowledge and capabilities.",
          "Self-learned new systems in absence of documentation, adapting quickly to evolving project needs.",
          "Developed and expanded UI systems, improving user interface responsiveness."
        ]
      }
    }
  },
  "wargaming": {
    "name": "WARGAMING",
    "date": "Aug 2018 - Jan 2022",
    "positions": {
      "software_engineer": {
        "role": "Software Engineer, Associate Software Engineer",
        "games": ["World of Tanks mobile game"],
        "date": "Aug 2019 - Jan 2022",
        "description": [
          "Developed and contributed to the development of UI and gameplay functionality using ReactJS.",
          "Implemented client-server communication.",
          "Assisted in server-side development to support client functionality.",
          "Managed unit and functional testing for the client to ensure robust performance and stability."
        ]
      },
      "software_test_engineer": {
        "role": "Software Test Engineer",
        "games": ["N/A"],
        "date": "July 2018 - Aug 2019",
        "description": [
          "Managed unit and functional testing for the client to ensure robust performance and stability."
        ]
      }
    }
  }
}